app/controllers/store_controller.rb

INSERT INTO "line_items" ("order_id", "updated_at", "total_price", "product_id", "quantity", "created_at") VALUES(1, '2011-01-13 15:46:29', 59.9, 1, 2, '2011-01-13 15:46:29')
INSERT INTO "orders" ("name", "updated_at", "pay_type", "address", "email", "created_at") VALUES('koyanagn', '2011-01-13 15:46:29', 'check', 'here', 'koyanagn@gmail.com', '2011-01-13 15:46:29')
---
  def save_order
    @cart =find_cart
    @order = Order.new(params[:order])
    @order.add_line_items_from_cart(@cart)
    if @order.save